{
  "privacyPolicy": [
    {
      "title": "Privacy Policy – FirgoMart",
      "effectiveDate": "26 July 2025"
    },
    {
      "title": "Introduction",
      "content": "FirgoMart (“FirgoMart”, “we”, “our”, or “us”) values the privacy of its users and is committed to protecting personal data shared with us. This Privacy Policy explains the manner in which information is collected, used, stored, processed, disclosed, and protected when you access or use the FirgoMart website, mobile application, or related services (collectively, the “Platform”).\n\nBy accessing or using the Platform, you acknowledge that you have read, understood, and agree to be bound by this Privacy Policy."
    },
    {
      "title": "1. Definitions",
      "content": "For the purposes of this Privacy Policy:\n• “Personal Information” means information that identifies a natural person\n• “Sensitive Personal Data or Information (SPDI)” shall have the meaning assigned under the Information Technology (SPDI) Rules, 2011\n• “User” “You” or “Your” refers to any person accessing or using the Platform\n• “Platform” refers to the FirgoMart website, mobile application, and related services"
    },
    {
      "title": "2. Scope and Applicability",
      "content": "This Privacy Policy applies to:\n• Visitors, registered users, customers, and sellers\n• Information collected online through the Platform\n• Information collected during transactions, communications, or customer support\n\nThis Policy does not apply to third-party websites or services linked from the Platform."
    },
    {
      "title": "3. Information We Collect",
      "content": "3.1 Information Provided Directly by You\n• Full name\n• Mobile number\n• Email address\n• Shipping and billing addresses\n• Account credentials\n• Order details, invoices, and customer communications\n\n3.2 Sensitive Personal Data or Information (SPDI)\n• Payment-related information required to process transactions\nFirgoMart does not store debit card, credit card, CVV, or banking credentials. Payments are processed through RBI-authorized third-party payment gateways.\n\n3.3 Automatically Collected Information\n• IP address and device identifiers\n• Browser, OS, and device type\n• Usage patterns, clickstream data, and logs\n• Cookies, pixels, and similar tracking technologies"
    },
    {
      "title": "4. Lawful Basis for Processing",
      "content": "FirgoMart processes personal data based on:\n• User consent\n• Performance of a contract (order fulfillment)\n• Compliance with legal obligations\n• Legitimate business interests"
    },
    {
      "title": "5. Purpose of Data Processing",
      "content": "Information is collected and used for:\n• User registration and authentication\n• Order processing, payment handling, and delivery\n• Customer support and grievance redressal\n• Platform analytics and service improvement\n• Fraud detection and security monitoring\n• Legal, regulatory, and audit compliance"
    },
    {
      "title": "6. Cookies and Tracking Technologies",
      "content": "FirgoMart uses cookies and similar technologies to:\n• Enable essential platform functionality\n• Store user preferences\n• Analyze traffic and usage behavior\n\nUsers may control cookies via browser or device settings; however, disabling cookies may affect certain features."
    },
    {
      "title": "7. Data Sharing and Disclosure",
      "content": "FirgoMart does not sell or rent personal data.\n\nInformation may be shared only with:\n• Logistics and delivery partners\n• Payment gateway service providers\n• Sellers (marketplace model)\n• IT and service providers acting on our behalf\n• Government or statutory authorities as required by law\n\nAll third parties are bound by confidentiality and data protection obligations."
    },
    {
      "title": "8. Cross-Border Data Transfer",
      "content": "Personal data may be stored or processed on servers located within or outside India. FirgoMart ensures that such transfers comply with applicable data protection laws and reasonable security safeguards."
    },
    {
      "title": "9. Data Security Measures",
      "content": "FirgoMart implements reasonable security practices, including:\n• Secure servers and encrypted data transmission\n• Access control and authentication mechanisms\n• Regular system monitoring\n\nDespite best efforts, absolute security cannot be guaranteed."
    },
    {
      "title": "10. Data Retention Policy",
      "content": "Personal data is retained only for as long as necessary to:\n• Fulfill stated purposes\n• Comply with legal and regulatory obligations\n• Resolve disputes and enforce agreements"
    },
    {
      "title": "11. User Rights and Choices",
      "content": "Users may:\n• Access and review personal data\n• Request correction or updates\n• Request account deletion (subject to legal obligations)\n• Withdraw consent where applicable\n\nRequests may be submitted via the contact details below."
    },
    {
      "title": "12. User Obligations",
      "content": "Users agree to:\n• Provide accurate and complete information\n• Maintain confidentiality of login credentials\n• Use the Platform in compliance with applicable laws\n\nFirgoMart is not responsible for inaccuracies provided by users."
    },
    {
      "title": "13. Third-Party Links and Services",
      "content": "The Platform may contain links to third-party websites or services. FirgoMart is not responsible for their privacy practices or content."
    },
    {
      "title": "14. Children’s Data",
      "content": "The Platform is not intended for individuals under 18 years of age. FirgoMart does not knowingly collect personal data of minors."
    },
    {
      "title": "15. Limitation of Liability",
      "content": "FirgoMart shall not be liable for:\n• Unauthorized access beyond reasonable control\n• Acts or omissions of third-party service providers\n• User negligence or misuse of the Platform"
    },
    {
      "title": "16. Indemnification",
      "content": "Users agree to indemnify and hold harmless FirgoMart from any claims, damages, or liabilities arising from misuse of the Platform or violation of this Privacy Policy."
    },
    {
      "title": "17. Force Majeure",
      "content": "FirgoMart shall not be liable for failure or delay in performance due to events beyond reasonable control, including natural disasters, technical failures, or governmental actions."
    },
    {
      "title": "18. Severability",
      "content": "If any provision of this Privacy Policy is held invalid, the remaining provisions shall continue in full force and effect."
    },
    {
      "title": "19. Waiver",
      "content": "Failure by FirgoMart to enforce any provision shall not constitute a waiver of such provision."
    },
    {
      "title": "20. Communication Address & Grievance Redressal",
      "content": "In accordance with the Information Technology Act, 2000 and applicable rules:\n\nCompany Name: FirgoMart 24Logistics Private Limited\nEmail: support@firgomart.com\n\nCommunication Address: Plot No. 678, 1st Floor,\nMajherpara, P.O. Hatiara, P.S. Newtown,\nNear Chota Masjid, Baguiati,\nKolkata, West Bengal – 700157, India\n\nAll grievances will be addressed within the time period prescribed under applicable law."
    },
    {
      "title": "21. Amendments",
      "content": "FirgoMart reserves the right to modify this Privacy Policy at any time. Updated versions will be effective upon publication on the Platform."
    },
    {
      "title": "22. Governing Law and Jurisdiction",
      "content": "This Privacy Policy shall be governed by the laws of India. All disputes shall be subject to the exclusive jurisdiction of competent courts in India."
    }
  ],
  "termsOfService": [
    {
      "title": "Terms and Conditions – FirgoMart",
      "effectiveDate": "26 July 2025",
      "intro": "These Terms and Conditions (\"Terms\") govern the access to and use of the FirgoMart website, mobile application, and related services (collectively, the \"Platform\"). The Platform is owned and operated by FirgoMart (\"we\", \"our\", \"us\"). By accessing, browsing, registering, or transacting on the Platform, you agree to be bound by these Terms. If you do not agree, please do not use the Platform."
    },
    {
      "title": "1. Definitions",
      "points": [
        "\"User\", \"You\", or \"Your\" means any person who accesses or uses the Platform",
        "\"Platform\" refers to the FirgoMart website, mobile application, and services",
        "\"Product(s)\" means goods listed for sale on the Platform",
        "\"Seller\" means a third-party seller offering products through the Platform (where applicable)"
      ]
    },
    {
      "title": "2. Eligibility",
      "points": [
        "You must be at least 18 years of age",
        "You must be capable of entering into a legally binding contract under Indian law",
        "By using the Platform, you represent and warrant that you meet these eligibility requirements"
      ]
    },
    {
      "title": "3. Account Registration",
      "points": [
        "You may be required to create an account to place orders",
        "You are responsible for maintaining the confidentiality of your login credentials",
        "You agree to provide accurate, complete, and updated information",
        "FirgoMart shall not be liable for any loss arising from unauthorized use of your account"
      ]
    },
    {
      "title": "4. Platform Usage",
      "points": [
        "Not to use the Platform for any unlawful or prohibited purpose",
        "Not to upload or transmit any harmful, misleading, or infringing content",
        "Not to attempt unauthorized access to the Platform or its systems",
        "FirgoMart reserves the right to suspend or terminate accounts violating these Terms"
      ]
    },
    {
      "title": "5. Product Information & Pricing",
      "points": [
        "Product images are for illustrative purposes only",
        "Prices, descriptions, and availability are subject to change without prior notice",
        "FirgoMart reserves the right to correct any pricing or listing errors"
      ]
    },
    {
      "title": "6. Orders & Acceptance",
      "points": [
        "Placing an order constitutes an offer to purchase",
        "FirgoMart reserves the right to accept or reject any order",
        "An order is confirmed only after payment confirmation and order acknowledgment"
      ]
    },
    {
      "title": "7. Payments",
      "points": [
        "Payments must be made through authorized payment methods available on the Platform",
        "FirgoMart does not store debit or credit card details",
        "All payments are processed via RBI-authorized third-party payment gateways"
      ]
    },
    {
      "title": "8. Shipping & Delivery",
      "points": [
        "Delivery timelines are estimates and may vary due to logistics or external factors",
        "FirgoMart shall not be liable for delays beyond reasonable control",
        "Risk of loss passes to the user upon delivery"
      ]
    },
    {
      "title": "9. Returns, Refunds & Cancellations",
      "content": "Returns, refunds, and cancellations are governed by the Return, Refund & Cancellation Policy, which forms an integral part of these Terms."
    },
    {
      "title": "10. Marketplace Disclaimer (If Applicable)",
      "points": [
        "FirgoMart may act as a marketplace connecting buyers and third-party sellers",
        "FirgoMart does not manufacture or own seller-listed products",
        "Seller is solely responsible for product quality, warranties, and compliance"
      ]
    },
    {
      "title": "11. Intellectual Property Rights",
      "content": "All content on the Platform, including logos, text, images, and software, is the property of FirgoMart. Unauthorized use, copying, or distribution is strictly prohibited."
    },
    {
      "title": "12. User Content",
      "points": [
        "Any reviews, feedback, or content submitted by users may be used by FirgoMart for marketing or operational purposes",
        "You grant FirgoMart a non-exclusive, royalty-free, perpetual license to use such content"
      ]
    },
    {
      "title": "13. Third-Party Links",
      "content": "The Platform may contain links to third-party websites. FirgoMart is not responsible for their content or practices."
    },
    {
      "title": "14. Limitation of Liability",
      "points": [
        "FirgoMart shall not be liable for indirect, incidental, or consequential damages",
        "Liability, if any, shall be limited to the value of the order in question"
      ]
    },
    {
      "title": "15. Indemnification",
      "points": [
        "Your misuse of the Platform",
        "Violation of these Terms",
        "Infringement of third-party rights"
      ]
    },
    {
      "title": "16. Force Majeure",
      "content": "FirgoMart shall not be liable for failure or delay in performance due to events beyond reasonable control, including natural disasters, technical failures, strikes, or governmental actions."
    },
    {
      "title": "17. Suspension & Termination",
      "points": [
        "Suspend or terminate access without prior notice for violation of these Terms",
        "Remove or disable content that violates applicable laws or policies"
      ]
    },
    {
      "title": "18. Severability",
      "content": "If any provision of these Terms is held invalid or unenforceable, the remaining provisions shall continue in full force."
    },
    {
      "title": "19. Waiver",
      "content": "Failure by FirgoMart to enforce any provision shall not constitute a waiver of such provision."
    },
    {
      "title": "20. Communication Address & Grievance Redressal",
      "content": "In accordance with the Information Technology Act, 2000 and applicable rules, users may contact us at: Company Name: FirgoMart, Email: support@firgomart.com, Communication Address: Plot No. 678, 1st Floor, Majherpara, P.O. Hatiara, P.S. Newtown, Near Chota Masjid, Baguiati, Kolkata, West Bengal – 700157, India."
    },
    {
      "title": "21. Amendments",
      "content": "FirgoMart reserves the right to modify these Terms at any time. Updated Terms will be effective upon posting on the Platform."
    },
    {
      "title": "22. Governing Law & Jurisdiction",
      "content": "These Terms shall be governed by and construed in accordance with the laws of India. All disputes shall be subject to the exclusive jurisdiction of competent courts in India."
    }
  ],
  "cookiesPolicy": [
    {
      "title": "Cookie Policy – FirgoMart",
      "effectiveDate": "26 July 2025",
      "intro": "This Cookie Policy explains how FirgoMart (\"FirgoMart\", \"we\", \"our\", or \"us\") uses cookies and similar tracking technologies on the FirgoMart website and mobile application (collectively, the \"Platform\"). This Policy should be read together with our Privacy Policy and Terms and Conditions. By continuing to use the Platform, you consent to the use of cookies in accordance with this Cookie Policy."
    },
    {
      "title": "1. What Are Cookies",
      "content": "Cookies are small text files that are stored on your device (computer, mobile phone, or tablet) when you visit a website or use an application. Cookies help the Platform recognize your device, remember preferences, and improve user experience."
    },
    {
      "title": "2. Types of Cookies We Use",
      "subSections": [
        {
          "title": "2.1 Essential Cookies",
          "content": "These cookies are mandatory for the Platform to function properly. They enable:",
          "points": [
            "User login and authentication",
            "Cart and checkout functionality",
            "Security and fraud prevention",
            "Without these cookies, the Platform may not function correctly"
          ]
        },
        {
          "title": "2.2 Performance & Analytics Cookies",
          "content": "These cookies help us understand how users interact with the Platform by collecting information such as:",
          "points": [
            "Pages visited",
            "Time spent on pages",
            "Error reports and performance data",
            "Data is aggregated and anonymized and used to improve Platform performance"
          ]
        },
        {
          "title": "2.3 Functional Cookies",
          "content": "These cookies allow the Platform to remember:",
          "points": [
            "Language preferences",
            "Location settings",
            "Saved login details (where applicable)",
            "They enhance user convenience and personalization"
          ]
        },
        {
          "title": "2.4 Advertising & Marketing Cookies",
          "content": "These cookies may be used to:",
          "points": [
            "Display relevant advertisements",
            "Measure the effectiveness of marketing campaigns",
            "Prevent repetitive ads",
            "Third-party advertising partners may place their own cookies subject to their privacy policies"
          ]
        }
      ]
    },
    {
      "title": "3. Third-Party Cookies",
      "content": "Some cookies may be placed by third-party service providers, including analytics providers, advertising networks, and payment or security service providers. FirgoMart does not control third-party cookies, and their use is governed by the respective third-party privacy policies."
    },
    {
      "title": "4. How We Use Cookie Data",
      "points": [
        "Ensure secure and smooth Platform operation",
        "Improve website and app functionality",
        "Analyze user behavior and trends",
        "Personalize content and advertisements",
        "Comply with legal and regulatory requirements"
      ]
    },
    {
      "title": "5. Managing Cookies",
      "points": [
        "Through browser settings",
        "Through mobile device settings",
        "Via cookie preference tools available on the Platform (if enabled)",
        "Disabling cookies may affect certain features and functionalities of the Platform"
      ]
    },
    {
      "title": "6. Mobile Application Tracking",
      "content": "In mobile applications, FirgoMart may use Software Development Kits (SDKs), device identifiers, and app analytics tools. These technologies function similarly to cookies and help improve app performance and user experience."
    },
    {
      "title": "7. Data Protection and Security",
      "content": "All information collected through cookies is handled in accordance with FirgoMart’s Privacy Policy. FirgoMart implements reasonable security measures to protect cookie-related data."
    },
    {
      "title": "8. Changes to This Cookie Policy",
      "content": "FirgoMart reserves the right to update or modify this Cookie Policy at any time. Any changes will be effective upon posting on the Platform."
    },
    {
      "title": "9. Contact Information",
      "content": "If you have any questions regarding this Cookie Policy, you may contact us at: Company Name: FirgoMart 24Logistics Private Limited, Email: support@firgomart.com."
    },
    {
      "title": "10. Governing Law and Jurisdiction",
      "content": "This Cookie Policy shall be governed by and construed in accordance with the laws of India. Any disputes shall be subject to the exclusive jurisdiction of competent courts in India."
    }
  ],
  "disclaimer": [
    { "title": "Disclaimer", "effectiveDate": "26 July 2025" },
    {
      "title": "1. General",
      "content": "Information on FirgoMart is provided in good faith for general purposes. We make no warranties about completeness or accuracy; use at your own discretion."
    },
    {
      "title": "2. External Links",
      "content": "We may link to external websites. We are not responsible for their content or practices."
    }
  ],
  "sitemap": [
    { "title": "Sitemap", "effectiveDate": "26 July 2025" },
    {
      "title": "1. Overview",
      "content": "This sitemap provides a structured overview of major sections including Home, Categories, Help Center, Policies, and Seller Resources."
    }
  ],
  "affiliateProgram": [
    { "title": "Affiliate Program", "effectiveDate": "26 July 2025" },
    {
      "title": "1. Participation",
      "content": "Join FirgoMart’s Affiliate Program to earn commissions by referring customers. Participation is subject to approval and compliance with program guidelines."
    },
    {
      "title": "2. Commission & Payouts",
      "content": "Commissions are calculated on eligible purchases and paid out as per the schedule. Fraudulent or self-referrals are prohibited."
    }
  ]
}
