{
  "privacyPolicy": [
    {
      "title": "Privacy Policy – FirgoMart",
      "effectiveDate": "26 July 2025"
    },
    {
      "title": "Introduction",
      "content": "This Privacy Policy (\"Policy\") describes how FirgoMart, operated and owned by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013 and having its principal place of business in India (\"Company\", \"FirgoMart\", \"we\", \"us\", or \"our\"), collects, receives, accesses, uses, processes, stores, discloses, transfers, retains, and protects information in connection with the operation of its e-commerce services.\n\nFirgoMart 24Logistics Private Limited is a legally recognised e-commerce operator under applicable Indian laws. The Company operates the FirgoMart mobile application, website, seller interfaces, administrative dashboards, APIs, and allied digital infrastructure (collectively, the \"Platform\"). FirgoMart functions both as an e-commerce operator facilitating sales by third-party sellers and as a direct seller where the Company procures products from manufacturers, brand owners, or authorised suppliers and sells such products through the Platform within India and, where permitted, to international customers.\n\nBy accessing, browsing, registering on, or otherwise using the Platform, you acknowledge that you have read, understood, and agreed to the collection, use, processing, storage, disclosure, and transfer of information as described in this Privacy Policy."
    },
    {
      "title": "1. Definitions",
      "content": "For the purposes of this Policy, FirgoMart or Company refers to FirgoMart 24Logistics Private Limited. User includes buyers, sellers (GST-registered and non-GST), manufacturers, vendors, service providers, logistics partners, payment partners, and visitors, whether located in India or internationally. Personal Data means any information relating to an identified or identifiable natural person. Sensitive Personal Data includes financial information, government-issued identification, authentication credentials, and any data afforded enhanced protection under applicable law. Processing includes collection, recording, organisation, structuring, storage, use, disclosure, transfer, combination, restriction, erasure, or destruction of information."
    },
    {
      "title": "2. Scope and Applicability",
      "content": "This Policy applies to all Users who access or use the Platform from India or any other jurisdiction. It governs information processed when FirgoMart operates as an e-commerce operator, when FirgoMart acts as a direct seller of products, and when third-party sellers sell products domestically or internationally through the Platform. Use of the Platform constitutes free, specific, informed, and unambiguous consent to the practices described in this Policy, subject to applicable law."
    },
    {
      "title": "3. Categories of Information Collected",
      "content": "FirgoMart may collect information including, without limitation, seller, manufacturer, and partner details such as legal name, business name, address, contact details, GSTIN where applicable, Aadhaar and PAN where legally required, incorporation or registration documents, KYC records, bank account and settlement details, and export or regulatory documentation. Buyer information may include name, contact details, shipping and billing addresses, order history, and communication records. FirgoMart does not store card numbers, UPI credentials, or banking passwords, and all payments are processed through authorised payment service providers. Technical and usage data may include IP address, device identifiers, operating system, browser type, cookies, log files, analytics data, and usage behaviour on the Platform."
    },
    {
      "title": "4. Lawful Basis for Processing",
      "content": "Information is processed on one or more of the following lawful bases: user consent, performance of contractual obligations, compliance with applicable legal and regulatory requirements, protection of vital interests, and legitimate business interests of FirgoMart as an e-commerce operator and direct seller."
    },
    {
      "title": "5. Purpose of Collection and Use",
      "content": "Information may be used for onboarding and verification of users, account creation and management, order processing, payment settlement, logistics and delivery, customer support, dispute resolution, compliance with GST, customs, FEMA, RBI, income-tax and other applicable laws, fraud detection and prevention, audits, investigations, security monitoring, analytics, research, and improvement of Platform services."
    },
    {
      "title": "6. Cookies and Tracking Technologies",
      "content": "FirgoMart uses cookies, software development kits, pixels, and similar tracking technologies to enable Platform functionality, analyse usage patterns, enhance security, prevent fraud, and improve user experience. Users may control or disable cookies through browser or device settings, subject to certain Platform features being unavailable. Where required by law, cookie consent mechanisms will be displayed before placing non-essential cookies."
    },
    {
      "title": "7. Data Sharing and Disclosure",
      "content": "FirgoMart may share information with government and regulatory authorities, tax departments, customs authorities, the Reserve Bank of India, law enforcement agencies, banks, payment gateways, logistics and fulfilment partners, auditors, insurers, technology vendors, and compliance service providers, strictly as required for lawful purposes and in accordance with applicable law and confidentiality obligations. Independent third-party sellers are responsible for their own handling of buyer information received for order fulfilment and act as independent data controllers under applicable law."
    },
    {
      "title": "8. Cross-Border Data Transfers",
      "content": "To facilitate global operations and international transactions, information may be transferred to, processed in, or stored in jurisdictions outside India. Such transfers shall be undertaken subject to reasonable contractual, technical, and organisational safeguards and in compliance with applicable data protection and privacy laws."
    },
    {
      "title": "9. Data Retention",
      "content": "Information is retained only for such period as is necessary to fulfil the purposes outlined in this Policy, comply with legal, regulatory, and accounting obligations, resolve disputes, enforce agreements, or meet legitimate business requirements, after which it is securely deleted, anonymised, or archived in accordance with applicable law and statutory retention requirements."
    },
    {
      "title": "10. Data Security Measures",
      "content": "FirgoMart implements reasonable administrative, technical, and physical safeguards designed to protect information against unauthorised access, alteration, disclosure, or destruction. Notwithstanding such measures, no method of transmission or storage is completely secure, and FirgoMart does not guarantee absolute security of information."
    },
    {
      "title": "11. User Rights",
      "content": "Subject to applicable law, including the Digital Personal Data Protection Act, 2023, Users may have the right to access their personal data, request correction or erasure, withdraw consent, restrict or object to certain processing, and nominate another person to exercise their rights in the event of death or incapacity. Requests may be made using the contact details provided below, and shall be addressed in accordance with legal timelines."
    },
    {
      "title": "12. Consent Withdrawal and Account Deletion",
      "content": "Users may withdraw consent or request deletion of their account by contacting FirgoMart at support@firgomart.com or through account settings where such functionality is available. Certain information may continue to be retained where required under applicable law, including tax, accounting, and regulatory obligations."
    },
    {
      "title": "13. Third-Party Services",
      "content": "The Platform may contain links to or integrations with third-party websites, applications, or services. FirgoMart is not responsible for the privacy practices, content, or security measures of such third parties, and Users are encouraged to review their respective privacy policies."
    },
    {
      "title": "14. Children’s Information",
      "content": "The Platform is not intended for use by individuals below the age permitted under applicable law. FirgoMart does not knowingly collect information from such individuals and will delete any such information upon becoming aware, in accordance with legal requirements."
    },
    {
      "title": "15. Amendments to the Policy",
      "content": "FirgoMart reserves the right to modify or update this Privacy Policy at any time. Any changes shall be effective upon publication on the Platform. Continued use of the Platform following such changes constitutes acceptance of the revised Policy."
    },
    {
      "title": "16. Grievance Redressal and Contact Information",
      "content": "Users may raise privacy-related queries, requests, or grievances by contacting FirgoMart at support@firgomart.com. Grievance Officer: To be notified. Designation: Grievance Officer and Data Protection Contact. Address: Registered office of FirgoMart 24Logistics Private Limited. Complaints shall be addressed within the timelines prescribed under applicable law."
    },
    {
      "title": "17. Governing Law and Jurisdiction",
      "content": "This Privacy Policy shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    }
  ],
  "termsOfService": [
    {
      "title": "Terms and Conditions – FirgoMart",
      "effectiveDate": "26 July 2025"
    },
    {
      "title": "Introduction",
      "content": "These Terms and Conditions (\"Terms\") govern the access to and use of the FirgoMart mobile application, website, seller panels, administrative systems, APIs, and all related digital platforms (collectively, the \"Platform\"). The Platform is owned and operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013, having its principal place of business in India (\"FirgoMart\", \"Company\", \"we\", \"us\", or \"our\").\n\nFirgoMart is a legally recognised E-commerce Operator under applicable Indian laws. FirgoMart operates as a technology-enabled e-commerce operator facilitating the sale of products by third-party sellers and also acts as a direct seller where it purchases products from manufacturers, brand owners, or authorised suppliers and sells such products through the Platform within India and globally.\n\nBy accessing, registering on, or using the Platform in any manner, you acknowledge that you have read, understood, and agreed to be bound by these Terms. If you do not agree, you must not access or use the Platform."
    },
    {
      "title": "1. Definitions",
      "content": "For the purposes of these Terms, Company or FirgoMart refers to FirgoMart 24Logistics Private Limited. User includes any individual or entity accessing the Platform, including buyers, sellers, manufacturers, vendors, service providers, and visitors. Seller includes Indian GST-registered sellers, Indian non-GST sellers onboarded using Aadhaar and PAN, international sellers, and FirgoMart acting as a direct seller. Buyer refers to any user purchasing products through the Platform. Goods means products listed or sold on the Platform. Applicable Law includes all Indian laws and, where relevant, foreign laws applicable to cross-border transactions."
    },
    {
      "title": "2. Nature of the Platform",
      "content": "FirgoMart is an e-commerce operator providing digital infrastructure to facilitate buying and selling of goods. FirgoMart is not an agent, partner, or representative of third-party sellers. Where FirgoMart sells products directly, FirgoMart shall be the seller of record for such transactions. For third-party seller transactions, the respective seller shall be solely responsible for the sale."
    },
    {
      "title": "3. Eligibility and Account Registration",
      "content": "Users must be legally competent to contract under applicable law. Sellers must provide accurate, complete, and up-to-date registration, KYC, tax, and compliance information. FirgoMart reserves the right to approve, reject, suspend, or terminate any account at its discretion."
    },
    {
      "title": "4. Seller Categories and Scope",
      "content": "Sellers on the Platform may include Indian GST-registered sellers, Indian non-GST sellers permitted to sell within their respective State or Union Territory only, international sellers subject to approval, and FirgoMart as a direct seller. Each seller category is governed by applicable legal and regulatory requirements."
    },
    {
      "title": "5. Non-GST Indian Sellers",
      "content": "Indian sellers who are not registered under GST may be permitted to sell on the Platform on the basis of valid Aadhaar Card and PAN, subject to applicable threshold exemptions. Such sellers may undertake only intra-state sales and shall not charge GST. Inter-state or international sales are strictly prohibited until GST registration is obtained and updated."
    },
    {
      "title": "6. GST-Registered Indian Sellers",
      "content": "GST-registered Indian sellers may undertake intra-state, inter-state, and international sales in accordance with applicable law. Such sellers are solely responsible for GST compliance, invoicing, returns, refunds, and statutory obligations."
    },
    {
      "title": "7. International Sales and Export Compliance",
      "content": "For cross-border transactions, sellers shall be solely responsible for compliance with the Foreign Trade Policy, Customs Act, FEMA, RBI guidelines, export documentation, duties, taxes, and foreign exchange realisation. FirgoMart shall not be deemed to be the exporter of record for third-party seller transactions."
    },
    {
      "title": "8. FirgoMart as Direct Seller",
      "content": "Where FirgoMart sells goods directly, FirgoMart shall be responsible for applicable taxes, compliance, and statutory obligations for such transactions, subject to applicable law."
    },
    {
      "title": "9. Pricing, Payments, and Settlements",
      "content": "Prices displayed on the Platform may include or exclude taxes as applicable. FirgoMart may facilitate payment collection and seller settlements. FirgoMart reserves the right to withhold, adjust, or recover amounts in case of disputes, non-compliance, or legal requirements."
    },
    {
      "title": "10. Platform Rights and Controls",
      "content": "FirgoMart reserves the right to monitor, review, suspend, delist, restrict, or remove any product, content, or account; modify Platform features; impose fees; and take actions necessary to protect legal, regulatory, or business interests."
    },
    {
      "title": "11. User Obligations",
      "content": "Users agree not to misuse the Platform, violate applicable laws, infringe intellectual property rights, or engage in fraudulent, misleading, or harmful activities."
    },
    {
      "title": "12. Intellectual Property",
      "content": "All intellectual property rights in the Platform, including trademarks, logos, software, and content, are owned by or licensed to FirgoMart. No rights are granted except as expressly provided."
    },
    {
      "title": "13. Limitation of Liability",
      "content": "To the maximum extent permitted by law, FirgoMart shall not be liable for indirect, incidental, consequential, or punitive damages arising from use of the Platform or third-party seller transactions."
    },
    {
      "title": "14. Indemnity",
      "content": "Users and sellers agree to indemnify and hold harmless FirgoMart against any claims, losses, penalties, or liabilities arising from their breach of these Terms or non-compliance with law."
    },
    {
      "title": "15. Termination",
      "content": "FirgoMart may terminate or suspend access to the Platform at any time without prior notice for violation of these Terms or applicable law."
    },
    {
      "title": "16. Force Majeure",
      "content": "FirgoMart shall not be liable for failure or delay caused by events beyond reasonable control, including natural disasters, government actions, system failures, or force majeure events."
    },
    {
      "title": "17. Governing Law and Jurisdiction",
      "content": "These Terms shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    }
  ],
  "cookiesPolicy": [
    {
      "title": "Cookie Policy – FirgoMart",
      "effectiveDate": "26 July 2025",
      "intro": "This Cookie Policy explains how FirgoMart, operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013 (\"Company\", \"FirgoMart\", \"we\", \"us\", or \"our\"), uses cookies and similar technologies on the FirgoMart mobile application, website, seller panels, administrative systems, APIs, and all related digital platforms (collectively, the \"Platform\"). FirgoMart is a legally recognised E-commerce Operator under applicable Indian laws and operates the Platform for domestic and global users, including buyers, sellers, manufacturers, and partners. By accessing or using the Platform, you consent to the use of cookies and similar technologies in accordance with this Cookie Policy, the Privacy Policy, and applicable law."
    },
    {
      "title": "1. What Are Cookies",
      "content": "Cookies are small text files that are placed on your device (computer, mobile phone, tablet, or other internet-enabled device) when you visit a website or use an application. Cookies help recognise your device, store preferences, enable core functionality, and improve user experience. Cookies may be session cookies (which expire when you close your browser or app) or persistent cookies (which remain stored on your device for a defined period or until deleted)."
    },
    {
      "title": "2. Types of Cookies Used by FirgoMart",
      "subSections": [
        {
          "title": "2.1 Strictly Necessary Cookies",
          "content": "These cookies are essential for the operation of the Platform. They enable basic functions such as:",
          "points": [
            "Account login and authentication",
            "Security and fraud prevention",
            "Shopping cart functionality",
            "Payment processing",
            "Without these cookies, the Platform may not function properly"
          ]
        },
        {
          "title": "2.2 Functional Cookies",
          "content": "Functional cookies allow the Platform to remember:",
          "points": [
            "User preferences",
            "Language selections",
            "Region or location settings",
            "Other personal customisations that enhance user experience"
          ]
        },
        {
          "title": "2.3 Performance and Analytics Cookies",
          "content": "These cookies collect information such as:",
          "points": [
            "Pages visited",
            "Time spent on the Platform",
            "Error reports",
            "Navigation patterns",
            "Data is aggregated and used to analyse performance and improve Platform functionality"
          ]
        },
        {
          "title": "2.4 Advertising and Marketing Cookies",
          "content": "Advertising cookies may be used to:",
          "points": [
            "Display relevant advertisements",
            "Measure marketing campaign effectiveness",
            "Limit repetitive ads",
            "Personalise promotional content across platforms"
          ]
        },
        {
          "title": "2.5 Security and Fraud Prevention Cookies",
          "content": "These cookies help:",
          "points": [
            "Detect suspicious activity",
            "Protect user accounts",
            "Prevent unauthorised access",
            "Enhance overall Platform security"
          ]
        }
      ]
    },
    {
      "title": "3. Similar Technologies",
      "content": "In addition to cookies, FirgoMart may use pixels, web beacons, software development kits (SDKs), local storage, and device identifiers to collect and process information for similar purposes as described in this Policy."
    },
    {
      "title": "4. Purpose of Using Cookies",
      "points": [
        "Enable core Platform functionality and secure access",
        "Authenticate users and manage sessions",
        "Process orders and payments",
        "Analyse usage patterns and improve services",
        "Prevent fraud, misuse, and unauthorised access",
        "Personalise user experience and content",
        "Support marketing, promotions, and communications",
        "Comply with legal and regulatory obligations"
      ]
    },
    {
      "title": "5. Third-Party Cookies",
      "content": "Some cookies may be placed by third-party service providers such as analytics providers, payment partners, advertising networks, logistics partners, and technology vendors. These third parties may use cookies in accordance with their own privacy and cookie policies. FirgoMart does not control the use of such third-party cookies."
    },
    {
      "title": "6. International Users and Cross-Border Operations",
      "content": "As FirgoMart operates globally, cookies and related data may be processed or stored outside India. Such processing shall be carried out with reasonable safeguards and in compliance with applicable data protection and privacy laws."
    },
    {
      "title": "7. Cookie Management and User Choices",
      "points": [
        "Users may manage or disable cookies through browser settings",
        "Users may manage cookies through mobile device settings",
        "Where required by law, cookie consent or preference tools may be provided",
        "Disabling certain cookies may affect functionality, security, and performance of the Platform"
      ]
    },
    {
      "title": "8. Data Protection and Privacy",
      "content": "Information collected through cookies may include personal data. Such information is processed in accordance with FirgoMart’s Privacy Policy and applicable laws. Cookies do not typically contain information that directly identifies users, but may be linked to personal data held by FirgoMart."
    },
    {
      "title": "9. Updates to This Cookie Policy",
      "content": "FirgoMart may update this Cookie Policy from time to time to reflect changes in technology, law, or business practices. Any changes shall be effective upon publication on the Platform. Continued use of the Platform constitutes acceptance of the updated Policy."
    },
    {
      "title": "10. Contact Information",
      "content": "For any questions or concerns regarding this Cookie Policy, users may contact: Company Name: FirgoMart 24Logistics Private Limited, Email: support@firgomart.com."
    },
    {
      "title": "11. Governing Law and Jurisdiction",
      "content": "This Cookie Policy shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    }
  ],
  "disclaimer": [
    {
      "title": "DISCLAIMER – FIRGOMART",
      "effectiveDate": "26 July 2025"
    },
    {
      "title": "Introduction",
      "content": "This Disclaimer governs the access to and use of the FirgoMart mobile application, website, seller interfaces, administrative systems, APIs, and all related digital platforms (collectively, the \"Platform\"). The Platform is owned and operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013, having its principal place of business in India (\"FirgoMart\", \"Company\", \"we\", \"us\", or \"our\").\n\nFirgoMart is a legally recognised E-commerce Operator under applicable Indian laws. FirgoMart facilitates transactions between buyers and third-party sellers and also sells certain products directly where FirgoMart procures goods from manufacturers, brand owners, or authorised suppliers and offers such goods for sale through the Platform within India and globally.\n\nBy accessing or using the Platform, you expressly acknowledge and agree to this Disclaimer."
    },
    {
      "title": "1. General Information Disclaimer",
      "content": "All information, content, materials, products, and services provided on the Platform are made available on an \"as is\" and \"as available\" basis. FirgoMart makes no representations or warranties regarding the accuracy, completeness, reliability, or suitability of any information available on the Platform."
    },
    {
      "title": "2. E-commerce Operator Role",
      "content": "FirgoMart operates as an e-commerce operator providing digital infrastructure and facilitation services. Except where FirgoMart is explicitly identified as the seller of record, FirgoMart does not own, control, manufacture, or supply products listed by third-party sellers and does not act as an agent, partner, or representative of such sellers."
    },
    {
      "title": "3. Direct Seller Disclaimer",
      "content": "For products sold directly by FirgoMart, FirgoMart shall be responsible only to the extent mandated under applicable law. All warranties, liabilities, and obligations shall be governed strictly by applicable statutes and written policies expressly provided."
    },
    {
      "title": "4. Third-Party Seller Responsibility",
      "content": "Third-party sellers are solely responsible for the quality, quantity, legality, safety, pricing, labelling, warranties, and compliance of their products. FirgoMart does not guarantee the performance, authenticity, or availability of third-party seller products."
    },
    {
      "title": "5. Global Transactions and Export Disclaimer",
      "content": "International transactions may be subject to customs duties, import or export restrictions, inspections, foreign regulations, and delays. FirgoMart does not guarantee delivery timelines, customs clearance, or acceptance of goods by foreign authorities for third-party seller products."
    },
    {
      "title": "6. Tax, GST, and Regulatory Disclaimer",
      "content": "Sellers are solely responsible for compliance with GST, customs laws, Foreign Trade Policy, FEMA, RBI guidelines, income-tax laws, and foreign regulations. FirgoMart does not provide tax, legal, accounting, or compliance advice."
    },
    {
      "title": "7. Non-GST Seller Disclaimer",
      "content": "Indian sellers who are not registered under GST are permitted to sell only within their respective State or Union Territory as allowed by law. Any violation of GST thresholds or legal requirements shall be the sole responsibility of such sellers."
    },
    {
      "title": "8. Pricing and Payment Disclaimer",
      "content": "Prices, taxes, fees, and charges displayed on the Platform may change without notice. FirgoMart is not responsible for pricing errors, currency fluctuations, payment failures, or banking delays beyond its control."
    },
    {
      "title": "9. Logistics and Delivery Disclaimer",
      "content": "Delivery, shipping, and logistics services may be provided by third-party partners. FirgoMart does not guarantee delivery timelines, service levels, or handling of shipments and shall not be liable for delays, loss, or damage caused by logistics partners."
    },
    {
      "title": "10. Technology and Availability Disclaimer",
      "content": "FirgoMart does not warrant uninterrupted or error-free operation of the Platform. Temporary suspension may occur due to maintenance, upgrades, technical failures, cyber incidents, or force majeure events."
    },
    {
      "title": "11. Limitation of Liability",
      "content": "To the maximum extent permitted by law, FirgoMart shall not be liable for any indirect, incidental, consequential, special, or punitive damages arising out of or in connection with the use of the Platform or transactions with third-party sellers."
    },
    {
      "title": "12. Indemnity Disclaimer",
      "content": "Users and sellers agree to indemnify and hold harmless FirgoMart from any claims, losses, damages, penalties, or liabilities arising from their use of the Platform or violation of applicable law."
    },
    {
      "title": "13. Third-Party Links Disclaimer",
      "content": "The Platform may contain links to third-party websites or services. FirgoMart does not endorse or control such third-party platforms and is not responsible for their content or practices."
    },
    {
      "title": "14. Force Majeure Disclaimer",
      "content": "FirgoMart shall not be liable for any failure or delay in performance resulting from events beyond its reasonable control, including natural disasters, governmental actions, strikes, system outages, or acts of God."
    },
    {
      "title": "15. No Professional Advice Disclaimer",
      "content": "Nothing on the Platform constitutes legal, tax, financial, or professional advice. Users should seek independent professional advice before acting on any information available on the Platform."
    },
    {
      "title": "16. Governing Law and Jurisdiction",
      "content": "This Disclaimer shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    },
    {
      "title": "Contact Information",
      "content": "For any questions or concerns regarding this Disclaimer, please contact support@firgomart.com."
    }
  ],
  "sitemap": [
    {
      "title": "Sitemap – FirgoMart",
      "effectiveDate": "26 July 2025",
      "intro": "This Sitemap outlines the structural layout of the FirgoMart digital ecosystem operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013. FirgoMart is a legally recognised E-commerce Operator and provides services to users in India and internationally through its website, mobile application, and related digital platforms. This Sitemap is intended for users, regulators, partners, and search engines to understand the organisation and navigation of FirgoMart’s Platform."
    },
    {
      "title": "1. Core Platform Pages",
      "items": [
        "Home – Overview of FirgoMart services, featured products, offers, and navigation access",
        "About Us – Company profile, business model, legal identity, and operational overview",
        "Contact Us – Customer support and official communication channels (Email: support@firgomart.com)",
        "Careers – Employment opportunities and company information"
      ]
    },
    {
      "title": "2. User Account Pages",
      "items": [
        "User Registration",
        "User Login",
        "User Profile Management",
        "Address Book",
        "Password and Security Settings"
      ]
    },
    {
      "title": "3. Buyer-Facing Pages",
      "items": [
        "Product Listing Pages",
        "Product Detail Pages",
        "Search and Filters",
        "Cart",
        "Checkout",
        "Order Confirmation",
        "Order History",
        "Returns and Refunds",
        "Wishlist",
        "Notifications"
      ]
    },
    {
      "title": "4. Seller-Facing Pages",
      "items": [
        "Seller Registration",
        "Seller Login",
        "Seller Dashboard",
        "Product Management",
        "Order Management",
        "Inventory Management",
        "Pricing and Tax Configuration",
        "Payout and Settlement Reports",
        "Seller Support"
      ]
    },
    {
      "title": "5. FirgoMart Direct Selling Pages",
      "items": [
        "FirgoMart-Owned Products",
        "Brand Stores",
        "Manufacturer-Sourced Product Collections",
        "Global Shipping Enabled Listings"
      ]
    },
    {
      "title": "6. International Commerce Pages",
      "items": [
        "Global Shipping Information",
        "International Orders",
        "Customs and Duties Information",
        "Export and Compliance Information",
        "Currency and Payment Information"
      ]
    },
    {
      "title": "7. Payment and Logistics Pages",
      "items": [
        "Payment Methods",
        "Payment Security",
        "Refund Policy",
        "Logistics and Delivery Information",
        "Shipment Tracking"
      ]
    },
    {
      "title": "8. Legal and Compliance Pages",
      "items": [
        "Privacy Policy",
        "Terms and Conditions",
        "Disclaimer",
        "Cookie Policy",
        "Seller Onboarding Agreement",
        "GST and Tax Information",
        "Compliance Disclosures",
        "Grievance Redressal Policy"
      ]
    },
    {
      "title": "9. Customer Support and Help Pages",
      "items": [
        "Help Center",
        "FAQs",
        "Returns and Cancellation Policy",
        "Buyer Protection Information",
        "Seller Guidelines"
      ]
    },
    {
      "title": "10. Marketing and Engagement Pages",
      "items": [
        "Offers and Promotions",
        "Coupons and Discounts",
        "Referral Programs",
        "Affiliate Information"
      ]
    },
    {
      "title": "11. System and Technical Pages",
      "items": [
        "API Documentation",
        "Developer Resources",
        "System Status",
        "Maintenance Notices"
      ]
    },
    {
      "title": "12. Policy Update and Notifications",
      "items": [
        "Policy Change Notices",
        "Legal Updates",
        "Platform Announcements"
      ]
    },
    {
      "title": "13. Accessibility and User Experience",
      "items": [
        "Accessibility Statement",
        "Language Selection",
        "Regional Settings"
      ]
    },
    {
      "title": "14. Security and Trust Pages",
      "items": [
        "Security Practices",
        "Fraud Prevention",
        "Account Safety Guidelines"
      ]
    },
    {
      "title": "15. Analytics and Feedback",
      "items": ["User Feedback", "Reviews and Ratings", "Surveys"]
    },
    {
      "title": "16. Miscellaneous Pages",
      "items": ["Blog / News", "Press Releases", "Media Kit"]
    },
    {
      "title": "Governing Law and Jurisdiction",
      "content": "This Sitemap and the operation of the FirgoMart Platform shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    }
  ],
  "affiliateProgram": [
    {
      "title": "Affiliate Program Policy – FirgoMart",
      "effectiveDate": "26 July 2025",
      "intro": "This Affiliate Program Policy (\"Policy\") governs participation in the FirgoMart Affiliate Program operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013 and having its principal place of business in India (\"FirgoMart\", \"Company\", \"we\", \"us\", or \"our\"). FirgoMart is a legally recognised E-commerce Operator under applicable Indian laws and offers an affiliate-based marketing program to eligible participants in India and internationally. By registering for or participating in the FirgoMart Affiliate Program, you (\"Affiliate\", \"you\", or \"Participant\") agree to be bound by this Policy, the FirgoMart Terms and Conditions, Privacy Policy, Cookie Policy, Disclaimer, and all applicable laws."
    },
    {
      "title": "1. Overview of the Affiliate Program",
      "content": "The FirgoMart Affiliate Program allows approved Affiliates to promote FirgoMart products and services through permitted marketing channels and earn commissions on qualifying purchases completed through valid affiliate links or codes, subject to the terms of this Policy."
    },
    {
      "title": "2. Eligibility and Enrollment",
      "content": "Participation in the Affiliate Program is subject to approval by FirgoMart. Affiliates may include individuals, sole proprietors, companies, content creators, influencers, publishers, and marketing partners, subject to verification and compliance requirements. FirgoMart reserves the right to accept or reject any application at its sole discretion."
    },
    {
      "title": "3. Affiliate Obligations",
      "points": [
        "Provide accurate and complete registration and payment information",
        "Promote FirgoMart in a lawful, ethical, and transparent manner",
        "Comply with all applicable advertising, consumer protection, and digital marketing laws",
        "Clearly disclose affiliate relationships where required by law",
        "Avoid misleading, deceptive, or false representations"
      ]
    },
    {
      "title": "4. Permitted Promotional Methods",
      "content": "Affiliates may promote FirgoMart through websites, blogs, social media, email marketing, mobile applications, and other digital channels approved by FirgoMart. Offline promotion, paid search bidding on FirgoMart trademarks, or use of spam techniques is prohibited unless expressly authorised."
    },
    {
      "title": "5. Prohibited Activities",
      "points": [
        "Engaging in fraudulent, misleading, or deceptive practices",
        "Using spam, unsolicited communications, or automated traffic",
        "Infringing intellectual property rights",
        "Impersonating FirgoMart or representing themselves as employees or agents",
        "Modifying, hiding, or manipulating affiliate tracking mechanisms"
      ]
    },
    {
      "title": "6. Commission Structure",
      "content": "Commissions are calculated based on qualifying transactions tracked through approved affiliate links or codes. Commission rates, qualifying criteria, and payment schedules may vary by product category, geography, or campaign and may be modified by FirgoMart from time to time."
    },
    {
      "title": "7. Tracking and Attribution",
      "content": "FirgoMart uses tracking technologies to attribute sales to Affiliates. FirgoMart does not guarantee uninterrupted or error-free tracking and shall not be liable for commissions lost due to technical issues beyond its reasonable control."
    },
    {
      "title": "8. Payments and Taxes",
      "content": "Affiliate payouts shall be made subject to minimum thresholds, verification, and applicable deductions. Affiliates are solely responsible for all taxes, GST, income tax, or other statutory liabilities arising from commissions earned. FirgoMart does not provide tax advice."
    },
    {
      "title": "9. Intellectual Property",
      "content": "FirgoMart grants Affiliates a limited, non-exclusive, non-transferable, and revocable licence to use approved FirgoMart trademarks, logos, and promotional materials solely for the purpose of participating in the Affiliate Program, subject to brand guidelines."
    },
    {
      "title": "10. Compliance with Laws",
      "content": "Affiliates must comply with all applicable laws, including advertising standards, consumer protection laws, data protection and privacy laws, GST and income-tax laws, and foreign regulations where applicable."
    },
    {
      "title": "11. Monitoring and Enforcement",
      "content": "FirgoMart reserves the right to monitor Affiliate activities, review promotional content, and take corrective action, including suspension or termination, in case of non-compliance."
    },
    {
      "title": "12. Suspension and Termination",
      "content": "FirgoMart may suspend or terminate an Affiliate account at any time, with or without notice, for breach of this Policy, suspected fraud, regulatory risk, or business reasons. Outstanding commissions may be withheld or forfeited in case of violation."
    },
    {
      "title": "13. Limitation of Liability",
      "content": "To the maximum extent permitted by law, FirgoMart shall not be liable for indirect, incidental, or consequential damages arising from participation in the Affiliate Program."
    },
    {
      "title": "14. Indemnity",
      "content": "Affiliates agree to indemnify and hold harmless FirgoMart from any claims, losses, penalties, or liabilities arising out of their participation in the Affiliate Program or violation of this Policy or applicable law."
    },
    {
      "title": "15. Modification of the Program",
      "content": "FirgoMart reserves the right to modify, suspend, or discontinue the Affiliate Program, commission structures, or this Policy at any time. Continued participation constitutes acceptance of such changes."
    },
    {
      "title": "16. Governing Law and Jurisdiction",
      "content": "This Policy shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    },
    {
      "title": "Contact Information",
      "content": "For any questions regarding the Affiliate Program, please contact FirgoMart at: support@firgomart.com."
    }
  ]
}
