{
  "privacyPolicy": [
    {
      "title": "Privacy Policy – FirgoMart",
      "effectiveDate": "26 July 2025"
    },
    {
      "title": "Introduction",
      "content": "This Privacy Policy (\"Policy\") explains how FirgoMart, operated and owned by FirgoMart 24Logistics Private Limited, an Indian private limited company incorporated under the Companies Act, 2013 and having its principal place of business in India (\"Company\", \"FirgoMart\", \"we\", \"us\", or \"our\"), collects, uses, processes, stores, shares, transfers, and protects information of users across India and internationally.\n\nFirgoMart operates a global e-commerce platform that enables buyers and sellers worldwide to transact, subject to applicable laws. This Policy applies to all users accessing the FirgoMart mobile application, website, seller portals, dashboards, APIs, and related digital infrastructure (collectively, the \"Platform\").\n\nBy accessing or using the Platform, you confirm that you have read, understood, and agreed to the practices described in this Privacy Policy."
    },
    {
      "title": "1. Scope and Applicability",
      "content": "This Policy applies to buyers located in India and outside India, Indian and international sellers, manufacturers and suppliers, logistics, payment and service partners, and visitors accessing the Platform globally. The Policy governs personal and business information processed when FirgoMart operates as a marketplace facilitator or as a direct seller of goods globally."
    },
    {
      "title": "2. Information We Collect",
      "content": "FirgoMart collects information from buyers, sellers, suppliers, and partners as necessary for operating the Platform and complying with applicable laws."
    },
    {
      "title": "2.1 Buyer Information (Global Buyers)",
      "content": "FirgoMart may collect full name, email address, contact number, shipping and billing addresses (domestic and international), order history, transaction records, communications, and customer support interactions."
    },
    {
      "title": "2.2 Seller and Supplier Information (Indian and International)",
      "content": "FirgoMart may collect legal name, business name, registered address, government-issued identification and business registration documents, tax identifiers such as GST, VAT, EIN or equivalent where applicable, bank account and settlement details, and export, customs, and regulatory documentation."
    },
    {
      "title": "2.3 Payment Information",
      "content": "FirgoMart does not store card numbers, UPI credentials, or banking passwords. All payments are processed through authorised payment service providers in accordance with applicable regulations."
    },
    {
      "title": "2.4 Technical and Usage Information",
      "content": "FirgoMart may automatically collect IP address, device identifiers, browser type, operating system, app version, cookies, log files, analytics data, and usage behaviour on the Platform."
    },
    {
      "title": "3. Purpose of Collection and Use",
      "content": "Information is collected and processed for onboarding, verification and account management, facilitating domestic and international transactions, order processing, payments, shipping and delivery, customs and regulatory compliance, fraud prevention and security, customer support, dispute resolution and grievance handling, analytics, audits, and improvement of Platform services."
    },
    {
      "title": "4. Lawful Basis for Processing",
      "content": "Information is processed based on one or more lawful grounds including user consent, performance of contractual obligations, compliance with legal and regulatory requirements, and legitimate business interests of FirgoMart as a global e-commerce operator."
    },
    {
      "title": "5. Global Data Sharing and Disclosure",
      "content": "Information may be shared with payment gateways and financial institutions, logistics and fulfilment partners, customs authorities, tax departments and regulators, banks, insurers, auditors and professional advisers, and technology and cloud service providers. All disclosures are made on a need-to-know basis and subject to confidentiality obligations."
    },
    {
      "title": "6. Cross-Border Data Transfers",
      "content": "To support global operations, information may be transferred to or processed in countries outside India. Such transfers are undertaken with appropriate contractual and technical safeguards and in compliance with applicable data protection laws."
    },
    {
      "title": "7. Data Retention",
      "content": "Information is retained only for as long as necessary to fulfil the purposes described in this Policy, comply with legal, tax, accounting, and regulatory requirements, and resolve disputes or enforce agreements, after which data is securely deleted, anonymised, or archived as permitted by law."
    },
    {
      "title": "8. Data Security Measures",
      "content": "FirgoMart implements reasonable administrative, technical, and organisational measures to protect information against unauthorised access, loss, misuse, alteration, or disclosure. However, no system can guarantee absolute security."
    },
    {
      "title": "9. User Rights (Global Users)",
      "content": "Subject to applicable law, users may request access to their information, correction or updating of inaccurate data, deletion or restriction of processing where legally permitted, and withdrawal of consent where applicable. Requests may be made through official support or grievance channels."
    },
    {
      "title": "10. Third-Party Services",
      "content": "The Platform may include links to or integrations with third-party services. FirgoMart is not responsible for the privacy practices of such third parties, and users should review their respective privacy policies."
    },
    {
      "title": "11. Children’s Privacy",
      "content": "The Platform is not intended for individuals below the age permitted under applicable law. FirgoMart does not knowingly collect information from such individuals and will delete such data upon becoming aware."
    },
    {
      "title": "12. Updates to this Policy",
      "content": "FirgoMart may update this Privacy Policy from time to time. Changes shall become effective upon publication on the Platform."
    },
    {
      "title": "13. GDPR & GLOBAL DATA PROTECTION COMPLIANCE",
      "content": "FirgoMart is committed to complying with the General Data Protection Regulation (EU) 2016/679 (\"GDPR\") and other applicable global data protection laws for users located in the European Union (EU), European Economic Area (EEA), the United Kingdom, and other jurisdictions with comparable privacy frameworks.\n\nFor the purposes of GDPR:\n\nData Controller: FirgoMart 24Logistics Private Limited\n\nData Subject: Any identified or identifiable natural person whose personal data is processed\n\nFirgoMart processes personal data in accordance with the principles set out under Article 5 of the GDPR, including lawfulness, fairness, transparency, purpose limitation, data minimisation, accuracy, storage limitation, integrity, and confidentiality."
    },
    {
      "title": "14. LAWFUL BASIS FOR PROCESSING (GDPR – ARTICLE 6)",
      "content": "Personal data is processed by FirgoMart on one or more lawful bases as defined under Article 6(1) of the GDPR, including:",
      "points": [
        "Consent of the data subject",
        "Performance of a contract, including order processing, payments, delivery, and customer support",
        "Compliance with legal obligations under applicable Indian and international laws",
        "Legitimate business interests of FirgoMart, including fraud prevention, platform security, analytics, audits, and service improvement"
      ]
    },
    {
      "content": "Where consent is relied upon, it is obtained and recorded in accordance with Article 7 of the GDPR."
    },
    {
      "title": "15. DATA SUBJECT RIGHTS (GDPR – ARTICLES 12 TO 23)",
      "content": "Subject to applicable law, data subjects are entitled to exercise the following rights:",
      "points": [
        "Right of Access – Article 15",
        "Right to Rectification – Article 16",
        "Right to Erasure (Right to be Forgotten) – Article 17",
        "Right to Restriction of Processing – Article 18",
        "Right to Data Portability – Article 20",
        "Right to Object – Article 21",
        "Rights relating to Automated Decision-Making and Profiling – Article 22"
      ]
    },
    {
      "content": "Requests may be submitted using the contact details provided in this Policy and will be addressed within legally prescribed timelines."
    },
    {
      "title": "16. WITHDRAWAL OF CONSENT (GDPR – ARTICLE 7)",
      "content": "Where processing is based on consent, data subjects have the right to withdraw consent at any time.\n\nWithdrawal of consent shall not affect the lawfulness of processing carried out prior to such withdrawal."
    },
    {
      "title": "17. CROSS-BORDER DATA TRANSFERS (GDPR – CHAPTER V)",
      "content": "To support global operations, personal data may be transferred to and processed in countries outside the EU, including India.\n\nSuch transfers are carried out in compliance with Chapter V of the GDPR, using appropriate safeguards such as:",
      "points": [
        "contractual protections;",
        "technical and organisational security measures; and",
        "compliance with applicable cross-border data transfer requirements."
      ]
    },
    {
      "title": "18. DATA RETENTION & STORAGE LIMITATION (GDPR – ARTICLE 5(1)(e))",
      "content": "Personal data is retained only for as long as necessary to:",
      "points": [
        "fulfil contractual and business purposes;",
        "comply with legal, tax, accounting, and regulatory requirements; and",
        "resolve disputes or enforce agreements."
      ]
    },
    {
      "content": "Upon expiry of the retention period, data is securely deleted, anonymised, or archived in accordance with applicable law."
    },
    {
      "title": "19. DATA SECURITY & BREACH MANAGEMENT (GDPR – ARTICLES 32, 33 & 34)",
      "content": "FirgoMart implements appropriate administrative, technical, and organisational measures to protect personal data against unauthorised access, loss, alteration, or disclosure.\n\nIn the event of a personal data breach:",
      "points": [
        "reasonable steps shall be taken to assess and contain the breach; and",
        "notifications shall be made to competent authorities and affected users where required under applicable law."
      ]
    },
    {
      "title": "20. AUTOMATED DECISION-MAKING & PROFILING",
      "content": "FirgoMart does not engage in automated decision-making or profiling that produces legal or similarly significant effects on users, except where permitted under Article 22 of the GDPR and applicable law.\n\nWhere such processing occurs, appropriate safeguards shall be implemented."
    },
    {
      "title": "21. OTHER GLOBAL PRIVACY LAWS",
      "content": "FirgoMart also recognises and respects user rights under other global privacy frameworks, including but not limited to:",
      "points": [
        "UK GDPR;",
        "California Consumer Privacy Act (CCPA/CPRA);",
        "other applicable international data protection regulations."
      ]
    },
    {
      "content": "Users may exercise applicable rights in accordance with their local laws."
    },
    {
      "title": "22. PRIVACY CONTACT & GRIEVANCE REDRESSAL",
      "content": "For privacy-related queries, data subject requests, or complaints, users may contact:\n\nEmail: support@firgomart.com\n\nRequests shall be handled in accordance with applicable law and within prescribed timelines."
    },
    {
      "title": "23. GOVERNING LAW & JURISDICTION",
      "content": "This Privacy Policy and this Addendum shall be governed by and construed in accordance with the laws of India, together with applicable international data protection laws where relevant.\n\nCourts having jurisdiction over FirgoMart 24Logistics Private Limited shall have exclusive jurisdiction, subject to mandatory rights of data subjects under applicable law."
    }
  ],
  "termsOfService": [
    {
      "title": "Terms and Conditions – FirgoMart",
      "effectiveDate": "26 July 2025"
    },
    {
      "title": "Introduction",
      "content": "These Terms and Conditions (\"Terms\") govern the access to and use of the FirgoMart mobile application, website, seller interfaces, administrative systems, APIs, and all related digital platforms and infrastructure (collectively, the \"Platform\"). The Platform is owned and operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013 and having its principal place of business in India (\"FirgoMart\", \"Company\", \"we\", \"us\", or \"our\").\n\nFirgoMart is a legally recognised e-commerce operator under applicable Indian laws. FirgoMart operates both as (a) a technology-enabled marketplace facilitating the sale of products by independent third-party sellers, and (b) a direct seller where FirgoMart purchases products from manufacturers, suppliers, or authorised vendors and sells such products in its own name through the Platform within India and internationally.\n\nBy accessing, registering on, browsing, or using the Platform in any manner, you acknowledge that you have read, understood, and agreed to be bound by these Terms. If you do not agree, you must not use the Platform."
    },
    {
      "title": "1. Definitions",
      "content": "Company or FirgoMart means FirgoMart 24Logistics Private Limited. User means any individual or legal entity accessing or using the Platform, including buyers, sellers, suppliers, manufacturers, service providers, logistics partners, payment partners, and visitors. Seller means a GST-registered Indian seller, an approved international seller, or FirgoMart acting as a direct seller. International Seller means a seller located outside India approved by FirgoMart to sell on the Platform subject to valid legal and regulatory documentation. Non-GST Indian Supplier means an Indian individual or entity not registered under GST who supplies goods exclusively to FirgoMart and does not sell directly to customers. Buyer means any User purchasing goods through the Platform. Goods means products listed, supplied, or sold through the Platform. Applicable Law means all laws, rules, regulations, notifications, and guidelines in force in India and, where relevant, foreign laws applicable to cross-border transactions."
    },
    {
      "title": "2. Nature of the Platform",
      "content": "FirgoMart provides digital infrastructure to enable the discovery, listing, sale, and distribution of goods. FirgoMart is not an agent, distributor, or partner of third-party sellers. For transactions involving third-party sellers, the respective seller is solely responsible for the sale of goods. Where FirgoMart sells products directly, FirgoMart shall be the seller of record and shall assume responsibility as per Applicable Law."
    },
    {
      "title": "3. Eligibility and Account Registration",
      "content": "Users must be legally competent to enter into binding contracts under Applicable Law. Sellers and suppliers must provide accurate, complete, and up-to-date KYC, tax, banking, and compliance information. FirgoMart reserves the right to approve, reject, suspend, restrict, or terminate any account or listing at its sole discretion, including for non-compliance with law or these Terms."
    },
    {
      "title": "4. Seller and Supplier Categories",
      "content": "The Platform supports the following categories: (a) GST-Registered Indian Sellers permitted to sell directly to customers, (b) International Sellers permitted to sell subject to approval and compliance, (c) Non-GST Indian Suppliers operating under a supply-only model with FirgoMart, and (d) FirgoMart acting as a Direct Seller. Each category operates under a distinct legal and commercial framework."
    },
    {
      "title": "5. International Sellers",
      "content": "International Sellers may sell on the Platform only after prior approval by FirgoMart and submission of valid legal, regulatory, tax, export, and business documentation. International Sellers are solely responsible for compliance with export laws, customs regulations, foreign exchange rules, duties, taxes, and documentation unless FirgoMart expressly acts as the direct seller. FirgoMart reserves the right to approve, reject, suspend, or terminate any International Seller account based on compliance, risk, or regulatory requirements."
    },
    {
      "title": "6. Non-GST Indian Suppliers – Supply-Only Model",
      "content": "Non-GST Indian Suppliers are not permitted to sell products directly to customers on the Platform and shall not be treated as sellers under e-commerce laws. Such suppliers cannot list products in their own name, cannot issue invoices to customers, and cannot sell domestically or internationally. Under this model, products are supplied to FirgoMart, FirgoMart purchases and becomes the legal owner of such products, and FirgoMart sells the products directly to customers in its own name in India and globally."
    },
    {
      "title": "6.1 Payment to Non-GST Indian Suppliers",
      "content": "For products supplied by Non-GST Indian Suppliers and sold by FirgoMart, FirgoMart shall make payment to the supplier within 15 (fifteen) days from the date of successful sale and completion of the applicable return or refund window. Payments shall be made to the supplier’s registered bank account, subject to agreed commercial terms and lawful deductions."
    },
    {
      "title": "7. GST-Registered Indian Sellers",
      "content": "GST-registered sellers may undertake intra-state, inter-state, and international sales in accordance with Applicable Law and are solely responsible for GST compliance, invoicing, tax payments, statutory filings, refunds, replacements, and after-sales obligations."
    },
    {
      "title": "8. International Sales and Export Compliance",
      "content": "For cross-border transactions, third-party sellers and International Sellers are responsible for compliance with the Foreign Trade Policy, Customs Act, FEMA, and RBI guidelines. FirgoMart shall not be deemed the exporter of record for third-party seller transactions. Where FirgoMart sells products directly, FirgoMart shall act as exporter where applicable."
    },
    {
      "title": "9. Pricing, Payments, and Settlements",
      "content": "Prices displayed on the Platform may be inclusive or exclusive of applicable taxes. FirgoMart may facilitate payment collection, settlements, deductions, adjustments, and recoveries. FirgoMart reserves the right to withhold or adjust payments in cases of disputes, fraud, non-compliance, or legal requirements."
    },
    {
      "title": "10. Platform Rights and Controls",
      "content": "FirgoMart reserves the right to monitor Platform activity, review listings, delist products, suspend or terminate accounts, modify Platform features or fees, and take any action necessary to protect legal, regulatory, security, or business interests."
    },
    {
      "title": "11. User Obligations",
      "content": "Users shall not misuse the Platform, violate Applicable Law, engage in fraudulent or misleading conduct, or infringe intellectual property rights."
    },
    {
      "title": "12. Intellectual Property",
      "content": "All intellectual property rights related to the Platform, including trademarks, logos, software, databases, and content, are owned by or licensed to FirgoMart. No rights are granted except as expressly stated in these Terms."
    },
    {
      "title": "13. Limitation of Liability",
      "content": "To the maximum extent permitted by law, FirgoMart shall not be liable for any indirect, incidental, consequential, or special damages arising from use of the Platform or third-party seller transactions."
    },
    {
      "title": "14. Indemnity",
      "content": "Users, sellers, and suppliers agree to indemnify and hold harmless FirgoMart against any claims, losses, penalties, or liabilities arising from breach of these Terms or violation of Applicable Law."
    },
    {
      "title": "15. Termination",
      "content": "FirgoMart may suspend or terminate access to the Platform at any time for non-compliance, risk management, or legal reasons. Termination does not affect accrued rights or obligations."
    },
    {
      "title": "16. Force Majeure",
      "content": "FirgoMart shall not be liable for failure or delay caused by events beyond reasonable control, including natural disasters, government actions, system failures, or other force majeure events."
    },
    {
      "title": "17. Governing Law and Jurisdiction",
      "content": "These Terms shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    },
    {
      "title": "18. International Orders",
      "content": "FirgoMart is operated and managed from India by FirgoMart 24Logistics Private Limited. All international orders placed through the FirgoMart website or mobile application are processed, packed, and shipped directly from India using approved international logistics partners."
    },
    {
      "title": "19. International Shipping and Customs",
      "content": "International delivery timelines may vary depending on the destination country, customs clearance procedures, regulatory checks, and logistics partner operations. Any delay caused by customs authorities, force majeure events, or circumstances beyond FirgoMart’s reasonable control shall not be treated as a breach of service obligations.\n\nAll customs duties, import taxes, VAT, clearance charges, or local levies imposed by the destination country are the sole responsibility of the buyer. FirgoMart does not collect, control, reimburse, or refund such charges."
    },
    {
      "title": "20. International Returns and Refunds",
      "content": "Orders shipped outside India are treated as final sale and are not eligible for standard returns or exchanges.\n\nRefunds for international orders shall be considered only in cases of damaged, defective, or incorrect products, subject to verification and approval by FirgoMart.\n\nFirgoMart reserves the right to process approved international refunds without requiring physical return of the product to India, depending on the nature of the issue. Customs duties, international shipping fees, and destination country charges are strictly non-refundable in all cases.\n\nReturn shipping for international orders will be charged at actual courier cost. Estimated reference range: GCC Countries approx. ₹2,500 per return; USA approx. ₹3,000 per return. Final charge will be as per actual reverse courier cost.\n\nInternational Cancellation Charges:\n- Before Dispatch: Full refund (gateway charges may be deducted if non-refundable).\n- After Dispatch: Treated as return. Return shipping cost applicable.\n\nNon-Refundable Components:\n- Original shipping charges\n- Payment gateway charges\n- Customs duty (if applicable)"
    },
    {
      "title": "21. Import Restrictions and Buyer Responsibility",
      "content": "Buyers are solely responsible for ensuring that products ordered through the Platform comply with the import laws, regulations, and restrictions of the destination country.\n\nIf an order is rejected, delayed, returned, seized, confiscated, or destroyed by customs or regulatory authorities due to prohibited items, documentation issues, or non-compliance with import regulations, FirgoMart shall not be liable for any refunds, replacements, or compensation."
    },
    {
      "title": "22. Payments, Currency, and Cash on Delivery",
      "content": "Cash on Delivery (COD) is available only for orders shipped within India. All international orders must be prepaid using supported online payment methods.\n\nPrices for international orders may be displayed in local currency or converted from Indian Rupees (INR) based on prevailing exchange rates. Any currency conversion fees, international transaction charges, or bank fees are determined solely by the payment service provider or issuing bank.\n\nRefunds for prepaid orders are processed only to the original payment method. International refunds may take additional time due to banking procedures, foreign exchange regulations, and cross-border settlement processes."
    }
  ],
  "cookiesPolicy": [
    {
      "title": "Cookie Policy – FirgoMart",
      "effectiveDate": "26 July 2025",
      "intro": "This Cookie Policy explains how FirgoMart, operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013 (\"Company\", \"FirgoMart\", \"we\", \"us\", or \"our\"), uses cookies and similar technologies on the FirgoMart mobile application, website, seller panels, administrative systems, APIs, and all related digital platforms (collectively, the \"Platform\"). FirgoMart is a legally recognised E-commerce Operator under applicable Indian laws and operates the Platform for domestic and global users, including buyers, sellers, manufacturers, and partners. By accessing or using the Platform, you consent to the use of cookies and similar technologies in accordance with this Cookie Policy, the Privacy Policy, and applicable law."
    },
    {
      "title": "1. What Are Cookies",
      "content": "Cookies are small text files that are placed on your device (computer, mobile phone, tablet, or other internet-enabled device) when you visit a website or use an application. Cookies help recognise your device, store preferences, enable core functionality, and improve user experience. Cookies may be session cookies (which expire when you close your browser or app) or persistent cookies (which remain stored on your device for a defined period or until deleted)."
    },
    {
      "title": "2. Types of Cookies Used by FirgoMart",
      "subSections": [
        {
          "title": "2.1 Strictly Necessary Cookies",
          "content": "These cookies are essential for the operation of the Platform. They enable basic functions such as:",
          "points": [
            "Account login and authentication",
            "Security and fraud prevention",
            "Shopping cart functionality",
            "Payment processing",
            "Without these cookies, the Platform may not function properly"
          ]
        },
        {
          "title": "2.2 Functional Cookies",
          "content": "Functional cookies allow the Platform to remember:",
          "points": [
            "User preferences",
            "Language selections",
            "Region or location settings",
            "Other personal customisations that enhance user experience"
          ]
        },
        {
          "title": "2.3 Performance and Analytics Cookies",
          "content": "These cookies collect information such as:",
          "points": [
            "Pages visited",
            "Time spent on the Platform",
            "Error reports",
            "Navigation patterns",
            "Data is aggregated and used to analyse performance and improve Platform functionality"
          ]
        },
        {
          "title": "2.4 Advertising and Marketing Cookies",
          "content": "Advertising cookies may be used to:",
          "points": [
            "Display relevant advertisements",
            "Measure marketing campaign effectiveness",
            "Limit repetitive ads",
            "Personalise promotional content across platforms"
          ]
        },
        {
          "title": "2.5 Security and Fraud Prevention Cookies",
          "content": "These cookies help:",
          "points": [
            "Detect suspicious activity",
            "Protect user accounts",
            "Prevent unauthorised access",
            "Enhance overall Platform security"
          ]
        }
      ]
    },
    {
      "title": "3. Similar Technologies",
      "content": "In addition to cookies, FirgoMart may use pixels, web beacons, software development kits (SDKs), local storage, and device identifiers to collect and process information for similar purposes as described in this Policy."
    },
    {
      "title": "4. Purpose of Using Cookies",
      "points": [
        "Enable core Platform functionality and secure access",
        "Authenticate users and manage sessions",
        "Process orders and payments",
        "Analyse usage patterns and improve services",
        "Prevent fraud, misuse, and unauthorised access",
        "Personalise user experience and content",
        "Support marketing, promotions, and communications",
        "Comply with legal and regulatory obligations"
      ]
    },
    {
      "title": "5. Third-Party Cookies",
      "content": "Some cookies may be placed by third-party service providers such as analytics providers, payment partners, advertising networks, logistics partners, and technology vendors. These third parties may use cookies in accordance with their own privacy and cookie policies. FirgoMart does not control the use of such third-party cookies."
    },
    {
      "title": "6. International Users and Cross-Border Operations",
      "content": "As FirgoMart operates globally, cookies and related data may be processed or stored outside India. Such processing shall be carried out with reasonable safeguards and in compliance with applicable data protection and privacy laws."
    },
    {
      "title": "7. Cookie Management and User Choices",
      "points": [
        "Users may manage or disable cookies through browser settings",
        "Users may manage cookies through mobile device settings",
        "Where required by law, cookie consent or preference tools may be provided",
        "Disabling certain cookies may affect functionality, security, and performance of the Platform"
      ]
    },
    {
      "title": "8. Data Protection and Privacy",
      "content": "Information collected through cookies may include personal data. Such information is processed in accordance with FirgoMart’s Privacy Policy and applicable laws. Cookies do not typically contain information that directly identifies users, but may be linked to personal data held by FirgoMart."
    },
    {
      "title": "9. Updates to This Cookie Policy",
      "content": "FirgoMart may update this Cookie Policy from time to time to reflect changes in technology, law, or business practices. Any changes shall be effective upon publication on the Platform. Continued use of the Platform constitutes acceptance of the updated Policy."
    },
    {
      "title": "10. Legal Basis for Using Cookies (GDPR – Article 6)",
      "content": "FirgoMart cookies and similar technologies are used and processed in accordance with Article 6 of the General Data Protection Regulation (EU) 2016/679 (“GDPR”) on one or more of the following lawful bases:",
      "points": [
        "User consent, where required under applicable law",
        "Performance of a contract, including secure access, order processing, and service delivery",
        "Compliance with legal and regulatory obligations",
        "Legitimate interests of FirgoMart, including platform security, fraud prevention, analytics, and service improvement"
      ]
    },
    {
      "title": "11. Cookie Consent and User Control (GDPR – Article 7)",
      "content": "Where required by law, FirgoMart obtains valid and informed user consent before placing non-essential cookies. Users may:",
      "points": [
        "Manage or withdraw cookie consent at any time through browser or device settings",
        "Use available cookie preference or consent tools, where provided"
      ]
    },
    {
      "content": "Withdrawal of consent shall not affect the lawfulness of processing carried out prior to such withdrawal. Disabling certain cookies may affect the functionality, performance, or security of the Platform."
    },
    {
      "title": "12. Data Retention for Cookies",
      "content": "Cookies are retained only for the period necessary to achieve their intended purpose:",
      "points": [
        "Session cookies are deleted automatically when the browser or application session ends",
        "Persistent cookies remain stored on the user’s device for a defined period or until manually deleted"
      ]
    },
    {
      "content": "Retention practices are aligned with the storage limitation principle under Article 5(1)(e) of the GDPR."
    },
    {
      "title": "13. International Data Transfers (GDPR – Chapter V)",
      "content": "As FirgoMart operates globally, information collected through cookies may be transferred to, processed, or stored in jurisdictions outside India or the European Union. Such transfers are conducted in accordance with Chapter V of the GDPR, using appropriate safeguards including contractual, technical, and organisational measures, and in compliance with applicable data protection laws."
    },
    {
      "title": "14. User Rights Under GDPR and Other Global Laws",
      "content": "Users located in the European Union, European Economic Area, United Kingdom, and other jurisdictions with similar data protection laws have rights relating to their personal data, including the right to:",
      "points": [
        "Access personal data",
        "Restrict or object to certain processing activities",
        "Request deletion or erasure of data, subject to applicable law"
      ]
    },
    {
      "content": "These rights may be exercised in accordance with FirgoMart’s Privacy Policy and applicable legal requirements."
    },
    {
      "title": "15. Contact Information",
      "content": "For questions, concerns, or requests relating to this Cookie Policy or the use of cookies, users may contact:\n\nEmail: support@firgomart.com"
    },
    {
      "title": "16. Governing Law and Jurisdiction",
      "content": "This Cookie Policy shall be governed by and construed in accordance with the laws of India, together with applicable international data protection laws, including the GDPR where relevant. Courts having jurisdiction over FirgoMart 24Logistics Private Limited shall have exclusive jurisdiction, subject to mandatory rights of users under applicable law."
    }
  ],
  "disclaimer": [
    {
      "title": "DISCLAIMER – FIRGOMART",
      "effectiveDate": "26 July 2025"
    },
    {
      "title": "Introduction",
      "content": "This Disclaimer governs the access to and use of the FirgoMart mobile application, website, seller interfaces, administrative systems, APIs, and all related digital platforms (collectively, the \"Platform\"). The Platform is owned and operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013, having its principal place of business in India (\"FirgoMart\", \"Company\", \"we\", \"us\", or \"our\").\n\nFirgoMart is a legally recognised E-commerce Operator under applicable Indian laws. FirgoMart facilitates transactions between buyers and third-party sellers and also sells certain products directly where FirgoMart procures goods from manufacturers, brand owners, or authorised suppliers and offers such goods for sale through the Platform within India and globally.\n\nBy accessing or using the Platform, you expressly acknowledge and agree to this Disclaimer."
    },
    {
      "title": "1. General Information Disclaimer",
      "content": "All information, content, materials, products, and services provided on the Platform are made available on an \"as is\" and \"as available\" basis. FirgoMart makes no representations or warranties regarding the accuracy, completeness, reliability, or suitability of any information available on the Platform."
    },
    {
      "title": "2. E-commerce Operator Role",
      "content": "FirgoMart operates as an e-commerce operator providing digital infrastructure and facilitation services. Except where FirgoMart is explicitly identified as the seller of record, FirgoMart does not own, control, manufacture, or supply products listed by third-party sellers and does not act as an agent, partner, or representative of such sellers."
    },
    {
      "title": "3. Direct Seller Disclaimer",
      "content": "For products sold directly by FirgoMart, FirgoMart shall be responsible only to the extent mandated under applicable law. All warranties, liabilities, and obligations shall be governed strictly by applicable statutes and written policies expressly provided."
    },
    {
      "title": "4. Third-Party Seller Responsibility",
      "content": "Third-party sellers are solely responsible for the quality, quantity, legality, safety, pricing, labelling, warranties, and compliance of their products. FirgoMart does not guarantee the performance, authenticity, or availability of third-party seller products."
    },
    {
      "title": "5. Global Transactions and Export Disclaimer",
      "content": "International transactions may be subject to customs duties, import or export restrictions, inspections, foreign regulations, and delays. FirgoMart does not guarantee delivery timelines, customs clearance, or acceptance of goods by foreign authorities for third-party seller products."
    },
    {
      "title": "6. Tax, GST, and Regulatory Disclaimer",
      "content": "Sellers are solely responsible for compliance with GST, customs laws, Foreign Trade Policy, FEMA, RBI guidelines, income-tax laws, and foreign regulations. FirgoMart does not provide tax, legal, accounting, or compliance advice."
    },
    {
      "title": "7. Non-GST Seller Disclaimer",
      "content": "Indian sellers who are not registered under GST are permitted to sell only within their respective State or Union Territory as allowed by law. Any violation of GST thresholds or legal requirements shall be the sole responsibility of such sellers."
    },
    {
      "title": "8. Pricing and Payment Disclaimer",
      "content": "Prices, taxes, fees, and charges displayed on the Platform may change without notice. FirgoMart is not responsible for pricing errors, currency fluctuations, payment failures, or banking delays beyond its control."
    },
    {
      "title": "9. Logistics and Delivery Disclaimer",
      "content": "Delivery, shipping, and logistics services may be provided by third-party partners. FirgoMart does not guarantee delivery timelines, service levels, or handling of shipments and shall not be liable for delays, loss, or damage caused by logistics partners."
    },
    {
      "title": "10. Technology and Availability Disclaimer",
      "content": "FirgoMart does not warrant uninterrupted or error-free operation of the Platform. Temporary suspension may occur due to maintenance, upgrades, technical failures, cyber incidents, or force majeure events."
    },
    {
      "title": "11. Limitation of Liability",
      "content": "To the maximum extent permitted by law, FirgoMart shall not be liable for any indirect, incidental, consequential, special, or punitive damages arising out of or in connection with the use of the Platform or transactions with third-party sellers."
    },
    {
      "title": "12. Indemnity Disclaimer",
      "content": "Users and sellers agree to indemnify and hold harmless FirgoMart from any claims, losses, damages, penalties, or liabilities arising from their use of the Platform or violation of applicable law."
    },
    {
      "title": "13. Third-Party Links Disclaimer",
      "content": "The Platform may contain links to third-party websites or services. FirgoMart does not endorse or control such third-party platforms and is not responsible for their content or practices."
    },
    {
      "title": "14. Force Majeure Disclaimer",
      "content": "FirgoMart shall not be liable for any failure or delay in performance resulting from events beyond its reasonable control, including natural disasters, governmental actions, strikes, system outages, or acts of God."
    },
    {
      "title": "15. No Professional Advice Disclaimer",
      "content": "Nothing on the Platform constitutes legal, tax, financial, or professional advice. Users should seek independent professional advice before acting on any information available on the Platform."
    },
    {
      "title": "16. Governing Law and Jurisdiction",
      "content": "This Disclaimer shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    },
    {
      "title": "Contact Information",
      "content": "For any questions or concerns regarding this Disclaimer, please contact support@firgomart.com."
    }
  ],
  "sitemap": [
    {
      "title": "Sitemap – FirgoMart",
      "effectiveDate": "26 July 2025",
      "intro": "This Sitemap outlines the structural layout of the FirgoMart digital ecosystem operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013. FirgoMart is a legally recognised E-commerce Operator and provides services to users in India and internationally through its website, mobile application, and related digital platforms. This Sitemap is intended for users, regulators, partners, and search engines to understand the organisation and navigation of FirgoMart’s Platform."
    },
    {
      "title": "1. Core Platform Pages",
      "items": [
        "Home – Overview of FirgoMart services, featured products, offers, and navigation access",
        "About Us – Company profile, business model, legal identity, and operational overview",
        "Contact Us – Customer support and official communication channels (Email: support@firgomart.com)",
        "Careers – Employment opportunities and company information"
      ]
    },
    {
      "title": "2. User Account Pages",
      "items": [
        "User Registration",
        "User Login",
        "User Profile Management",
        "Address Book",
        "Password and Security Settings"
      ]
    },
    {
      "title": "3. Buyer-Facing Pages",
      "items": [
        "Product Listing Pages",
        "Product Detail Pages",
        "Search and Filters",
        "Cart",
        "Checkout",
        "Order Confirmation",
        "Order History",
        "Returns and Refunds",
        "Wishlist",
        "Notifications"
      ]
    },
    {
      "title": "4. Seller-Facing Pages",
      "items": [
        "Seller Registration",
        "Seller Login",
        "Seller Dashboard",
        "Product Management",
        "Order Management",
        "Inventory Management",
        "Pricing and Tax Configuration",
        "Payout and Settlement Reports",
        "Seller Support"
      ]
    },
    {
      "title": "5. FirgoMart Direct Selling Pages",
      "items": [
        "FirgoMart-Owned Products",
        "Brand Stores",
        "Manufacturer-Sourced Product Collections",
        "Global Shipping Enabled Listings"
      ]
    },
    {
      "title": "6. International Commerce Pages",
      "items": [
        "Global Shipping Information",
        "International Orders",
        "Customs and Duties Information",
        "Export and Compliance Information",
        "Currency and Payment Information"
      ]
    },
    {
      "title": "7. Payment and Logistics Pages",
      "items": [
        "Payment Methods",
        "Payment Security",
        "Refund Policy",
        "Logistics and Delivery Information",
        "Shipment Tracking"
      ]
    },
    {
      "title": "8. Legal and Compliance Pages",
      "items": [
        "Privacy Policy",
        "Terms and Conditions",
        "Disclaimer",
        "Cookie Policy",
        "Seller Onboarding Agreement",
        "GST and Tax Information",
        "Compliance Disclosures",
        "Grievance Redressal Policy"
      ]
    },
    {
      "title": "9. Customer Support and Help Pages",
      "items": [
        "Help Center",
        "FAQs",
        "Returns and Cancellation Policy",
        "Buyer Protection Information",
        "Seller Guidelines"
      ]
    },
    {
      "title": "10. Marketing and Engagement Pages",
      "items": [
        "Offers and Promotions",
        "Coupons and Discounts",
        "Referral Programs",
        "Affiliate Information"
      ]
    },
    {
      "title": "11. System and Technical Pages",
      "items": [
        "API Documentation",
        "Developer Resources",
        "System Status",
        "Maintenance Notices"
      ]
    },
    {
      "title": "12. Policy Update and Notifications",
      "items": [
        "Policy Change Notices",
        "Legal Updates",
        "Platform Announcements"
      ]
    },
    {
      "title": "13. Accessibility and User Experience",
      "items": [
        "Accessibility Statement",
        "Language Selection",
        "Regional Settings"
      ]
    },
    {
      "title": "14. Security and Trust Pages",
      "items": [
        "Security Practices",
        "Fraud Prevention",
        "Account Safety Guidelines"
      ]
    },
    {
      "title": "15. Analytics and Feedback",
      "items": ["User Feedback", "Reviews and Ratings", "Surveys"]
    },
    {
      "title": "16. Miscellaneous Pages",
      "items": ["Blog / News", "Press Releases", "Media Kit"]
    },
    {
      "title": "Governing Law and Jurisdiction",
      "content": "This Sitemap and the operation of the FirgoMart Platform shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    }
  ],
  "affiliateProgram": [
    {
      "title": "Affiliate Program Policy – FirgoMart",
      "effectiveDate": "26 July 2025",
      "intro": "This Affiliate Program Policy (\"Policy\") governs participation in the FirgoMart Affiliate Program operated by FirgoMart 24Logistics Private Limited, an Indian Private Limited Company incorporated under the Companies Act, 2013 and having its principal place of business in India (\"FirgoMart\", \"Company\", \"we\", \"us\", or \"our\"). FirgoMart is a legally recognised E-commerce Operator under applicable Indian laws and offers an affiliate-based marketing program to eligible participants in India and internationally. By registering for or participating in the FirgoMart Affiliate Program, you (\"Affiliate\", \"you\", or \"Participant\") agree to be bound by this Policy, the FirgoMart Terms and Conditions, Privacy Policy, Cookie Policy, Disclaimer, and all applicable laws."
    },
    {
      "title": "1. Overview of the Affiliate Program",
      "content": "The FirgoMart Affiliate Program allows approved Affiliates to promote FirgoMart products and services through permitted marketing channels and earn commissions on qualifying purchases completed through valid affiliate links or codes, subject to the terms of this Policy."
    },
    {
      "title": "2. Eligibility and Enrollment",
      "content": "Participation in the Affiliate Program is subject to approval by FirgoMart. Affiliates may include individuals, sole proprietors, companies, content creators, influencers, publishers, and marketing partners, subject to verification and compliance requirements. FirgoMart reserves the right to accept or reject any application at its sole discretion."
    },
    {
      "title": "3. Affiliate Obligations",
      "points": [
        "Provide accurate and complete registration and payment information",
        "Promote FirgoMart in a lawful, ethical, and transparent manner",
        "Comply with all applicable advertising, consumer protection, and digital marketing laws",
        "Clearly disclose affiliate relationships where required by law",
        "Avoid misleading, deceptive, or false representations"
      ]
    },
    {
      "title": "4. Permitted Promotional Methods",
      "content": "Affiliates may promote FirgoMart through websites, blogs, social media, email marketing, mobile applications, and other digital channels approved by FirgoMart. Offline promotion, paid search bidding on FirgoMart trademarks, or use of spam techniques is prohibited unless expressly authorised."
    },
    {
      "title": "5. Prohibited Activities",
      "points": [
        "Engaging in fraudulent, misleading, or deceptive practices",
        "Using spam, unsolicited communications, or automated traffic",
        "Infringing intellectual property rights",
        "Impersonating FirgoMart or representing themselves as employees or agents",
        "Modifying, hiding, or manipulating affiliate tracking mechanisms"
      ]
    },
    {
      "title": "6. Commission Structure",
      "content": "Commissions are calculated based on qualifying transactions tracked through approved affiliate links or codes. Commission rates, qualifying criteria, and payment schedules may vary by product category, geography, or campaign and may be modified by FirgoMart from time to time."
    },
    {
      "title": "7. Tracking and Attribution",
      "content": "FirgoMart uses tracking technologies to attribute sales to Affiliates. FirgoMart does not guarantee uninterrupted or error-free tracking and shall not be liable for commissions lost due to technical issues beyond its reasonable control."
    },
    {
      "title": "8. Payments and Taxes",
      "content": "Affiliate payouts shall be made subject to minimum thresholds, verification, and applicable deductions. Affiliates are solely responsible for all taxes, GST, income tax, or other statutory liabilities arising from commissions earned. FirgoMart does not provide tax advice."
    },
    {
      "title": "9. Intellectual Property",
      "content": "FirgoMart grants Affiliates a limited, non-exclusive, non-transferable, and revocable licence to use approved FirgoMart trademarks, logos, and promotional materials solely for the purpose of participating in the Affiliate Program, subject to brand guidelines."
    },
    {
      "title": "10. Compliance with Laws",
      "content": "Affiliates must comply with all applicable laws, including advertising standards, consumer protection laws, data protection and privacy laws, GST and income-tax laws, and foreign regulations where applicable."
    },
    {
      "title": "11. Monitoring and Enforcement",
      "content": "FirgoMart reserves the right to monitor Affiliate activities, review promotional content, and take corrective action, including suspension or termination, in case of non-compliance."
    },
    {
      "title": "12. Suspension and Termination",
      "content": "FirgoMart may suspend or terminate an Affiliate account at any time, with or without notice, for breach of this Policy, suspected fraud, regulatory risk, or business reasons. Outstanding commissions may be withheld or forfeited in case of violation."
    },
    {
      "title": "13. Limitation of Liability",
      "content": "To the maximum extent permitted by law, FirgoMart shall not be liable for indirect, incidental, or consequential damages arising from participation in the Affiliate Program."
    },
    {
      "title": "14. Indemnity",
      "content": "Affiliates agree to indemnify and hold harmless FirgoMart from any claims, losses, penalties, or liabilities arising out of their participation in the Affiliate Program or violation of this Policy or applicable law."
    },
    {
      "title": "15. Modification of the Program",
      "content": "FirgoMart reserves the right to modify, suspend, or discontinue the Affiliate Program, commission structures, or this Policy at any time. Continued participation constitutes acceptance of such changes."
    },
    {
      "title": "16. Governing Law and Jurisdiction",
      "content": "This Policy shall be governed by and construed in accordance with the laws of India. Courts having jurisdiction over FirgoMart shall have exclusive jurisdiction."
    },
    {
      "title": "Contact Information",
      "content": "For any questions regarding the Affiliate Program, please contact FirgoMart at: support@firgomart.com."
    }
  ]
}
